Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_uart4.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32L4R5_uart4.
; ================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32L4R5_uart4 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// UART4 address definitions
// -------------------------

typedef struct {
        union {
    volatile    uint32_t    CR1;
    volatile    uint32_t    CR1_ALTERNATE;
        };
    volatile    uint32_t    CR2;
    volatile    uint32_t    CR3;
    volatile    uint32_t    BRR;
    volatile    uint32_t    GTPR;
    volatile    uint32_t    RTOR;
    volatile    uint32_t    RQR;
        union {
    volatile    uint32_t    ISR;
    volatile    uint32_t    ISR_ALTERNATE;
        };
    volatile    uint32_t    ICR;
    volatile    uint32_t    RDR;
    volatile    uint32_t    TDR;
    volatile    uint32_t    PRESC;
} UART4_TypeDef;

#ifdef __cplusplus
#define UART4   reinterpret_cast<UART4_TypeDef *>(0x40004C00U)

#else
#define UART4   ((UART4_TypeDef *)0x40004C00U)
#endif

// CR1 Configuration

#define UART4_CR1_RXFFIE                    (0x1U<<31)
#define UART4_CR1_TXFEIE                    (0x1U<<30)
#define UART4_CR1_FIFOEN                    (0x1U<<29)
#define UART4_CR1_M1                        (0x1U<<28)
#define UART4_CR1_EOBIE                     (0x1U<<27)
#define UART4_CR1_RTOIE                     (0x1U<<26)
#define UART4_CR1_DEAT                      (0x1FU<<21)
#define UART4_CR1_DEAT_0                    (0x1U<<21)
#define UART4_CR1_DEDT                      (0x1FU<<16)
#define UART4_CR1_DEDT_0                    (0x1U<<16)
#define UART4_CR1_OVER8                     (0x1U<<15)
#define UART4_CR1_CMIE                      (0x1U<<14)
#define UART4_CR1_MME                       (0x1U<<13)
#define UART4_CR1_M0                        (0x1U<<12)
#define UART4_CR1_WAKE                      (0x1U<<11)
#define UART4_CR1_PCE                       (0x1U<<10)
#define UART4_CR1_PS                        (0x1U<<9)
#define UART4_CR1_PEIE                      (0x1U<<8)
#define UART4_CR1_TXFNFIE                   (0x1U<<7)
#define UART4_CR1_TCIE                      (0x1U<<6)
#define UART4_CR1_RXFNEIE                   (0x1U<<5)
#define UART4_CR1_IDLEIE                    (0x1U<<4)
#define UART4_CR1_TE                        (0x1U<<3)
#define UART4_CR1_RE                        (0x1U<<2)
#define UART4_CR1_UESM                      (0x1U<<1)
#define UART4_CR1_UE                        (0x1U<<0)
#define UART4_CR1_RXFFIE_B_0X0              (0x0U<<31)
#define UART4_CR1_RXFFIE_B_0X1              (0x1U<<31)
#define UART4_CR1_TXFEIE_B_0X0              (0x0U<<30)
#define UART4_CR1_TXFEIE_B_0X1              (0x1U<<30)
#define UART4_CR1_FIFOEN_B_0X0              (0x0U<<29)
#define UART4_CR1_FIFOEN_B_0X1              (0x1U<<29)
#define UART4_CR1_EOBIE_B_0X0               (0x0U<<27)
#define UART4_CR1_EOBIE_B_0X1               (0x1U<<27)
#define UART4_CR1_RTOIE_B_0X0               (0x0U<<26)
#define UART4_CR1_RTOIE_B_0X1               (0x1U<<26)
#define UART4_CR1_OVER8_B_0X0               (0x0U<<15)
#define UART4_CR1_OVER8_B_0X1               (0x1U<<15)
#define UART4_CR1_CMIE_B_0X0                (0x0U<<14)
#define UART4_CR1_CMIE_B_0X1                (0x1U<<14)
#define UART4_CR1_MME_B_0X0                 (0x0U<<13)
#define UART4_CR1_MME_B_0X1                 (0x1U<<13)
#define UART4_CR1_WAKE_B_0X0                (0x0U<<11)
#define UART4_CR1_WAKE_B_0X1                (0x1U<<11)
#define UART4_CR1_PCE_B_0X0                 (0x0U<<10)
#define UART4_CR1_PCE_B_0X1                 (0x1U<<10)
#define UART4_CR1_PS_B_0X0                  (0x0U<<9)
#define UART4_CR1_PS_B_0X1                  (0x1U<<9)
#define UART4_CR1_PEIE_B_0X0                (0x0U<<8)
#define UART4_CR1_PEIE_B_0X1                (0x1U<<8)
#define UART4_CR1_TXFNFIE_B_0X0             (0x0U<<7)
#define UART4_CR1_TXFNFIE_B_0X1             (0x1U<<7)
#define UART4_CR1_TCIE_B_0X0                (0x0U<<6)
#define UART4_CR1_TCIE_B_0X1                (0x1U<<6)
#define UART4_CR1_RXFNEIE_B_0X0             (0x0U<<5)
#define UART4_CR1_RXFNEIE_B_0X1             (0x1U<<5)
#define UART4_CR1_IDLEIE_B_0X0              (0x0U<<4)
#define UART4_CR1_IDLEIE_B_0X1              (0x1U<<4)
#define UART4_CR1_TE_B_0X0                  (0x0U<<3)
#define UART4_CR1_TE_B_0X1                  (0x1U<<3)
#define UART4_CR1_RE_B_0X0                  (0x0U<<2)
#define UART4_CR1_RE_B_0X1                  (0x1U<<2)
#define UART4_CR1_UESM_B_0X0                (0x0U<<1)
#define UART4_CR1_UESM_B_0X1                (0x1U<<1)
#define UART4_CR1_UE_B_0X0                  (0x0U<<0)
#define UART4_CR1_UE_B_0X1                  (0x1U<<0)

// CR1_ALTERNATE Configuration

