Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_uart4.h
#define UART4_RQR_TXFRQ                     (0x1U<<4)
#define UART4_RQR_RXFRQ                     (0x1U<<3)
#define UART4_RQR_MMRQ                      (0x1U<<2)
#define UART4_RQR_SBKRQ                     (0x1U<<1)
#define UART4_RQR_ABRRQ                     (0x1U<<0)

// ISR Configuration

#define UART4_ISR_TXFT                      (0x1U<<27)
#define UART4_ISR_RXFT                      (0x1U<<26)
#define UART4_ISR_TCBGT                     (0x1U<<25)
#define UART4_ISR_RXFF                      (0x1U<<24)
#define UART4_ISR_TXFE                      (0x1U<<23)
#define UART4_ISR_REACK                     (0x1U<<22)
#define UART4_ISR_TEACK                     (0x1U<<21)
#define UART4_ISR_WUF                       (0x1U<<20)
#define UART4_ISR_RWU                       (0x1U<<19)
#define UART4_ISR_SBKF                      (0x1U<<18)
#define UART4_ISR_CMF                       (0x1U<<17)
#define UART4_ISR_BUSY                      (0x1U<<16)
#define UART4_ISR_ABRF                      (0x1U<<15)
#define UART4_ISR_ABRE                      (0x1U<<14)
#define UART4_ISR_UDR                       (0x1U<<13)
#define UART4_ISR_EOBF                      (0x1U<<12)
#define UART4_ISR_RTOF                      (0x1U<<11)
#define UART4_ISR_CTS                       (0x1U<<10)
#define UART4_ISR_CTSIF                     (0x1U<<9)
#define UART4_ISR_LBDF                      (0x1U<<8)
#define UART4_ISR_TXFNF                     (0x1U<<7)
#define UART4_ISR_TC                        (0x1U<<6)
#define UART4_ISR_RXFNE                     (0x1U<<5)
#define UART4_ISR_IDLE                      (0x1U<<4)
#define UART4_ISR_ORE                       (0x1U<<3)
#define UART4_ISR_NE                        (0x1U<<2)
#define UART4_ISR_FE                        (0x1U<<1)
#define UART4_ISR_PE                        (0x1U<<0)
#define UART4_ISR_TXFT_B_0X0                (0x0U<<27)
#define UART4_ISR_TXFT_B_0X1                (0x1U<<27)
#define UART4_ISR_RXFT_B_0X0                (0x0U<<26)
#define UART4_ISR_RXFT_B_0X1                (0x1U<<26)
#define UART4_ISR_TCBGT_B_0X0               (0x0U<<25)
#define UART4_ISR_TCBGT_B_0X1               (0x1U<<25)
#define UART4_ISR_RXFF_B_0X0                (0x0U<<24)
#define UART4_ISR_RXFF_B_0X1                (0x1U<<24)
#define UART4_ISR_TXFE_B_0X0                (0x0U<<23)
#define UART4_ISR_TXFE_B_0X1                (0x1U<<23)
#define UART4_ISR_RWU_B_0X0                 (0x0U<<19)
#define UART4_ISR_RWU_B_0X1                 (0x1U<<19)
#define UART4_ISR_SBKF_B_0X0                (0x0U<<18)
#define UART4_ISR_SBKF_B_0X1                (0x1U<<18)
#define UART4_ISR_CMF_B_0X0                 (0x0U<<17)
#define UART4_ISR_CMF_B_0X1                 (0x1U<<17)
#define UART4_ISR_BUSY_B_0X0                (0x0U<<16)
#define UART4_ISR_BUSY_B_0X1                (0x1U<<16)
#define UART4_ISR_UDR_B_0X0                 (0x0U<<13)
#define UART4_ISR_UDR_B_0X1                 (0x1U<<13)
#define UART4_ISR_EOBF_B_0X0                (0x0U<<12)
#define UART4_ISR_EOBF_B_0X1                (0x1U<<12)
#define UART4_ISR_RTOF_B_0X0                (0x0U<<11)
#define UART4_ISR_RTOF_B_0X1                (0x1U<<11)
#define UART4_ISR_CTS_B_0X0                 (0x0U<<10)
#define UART4_ISR_CTS_B_0X1                 (0x1U<<10)
#define UART4_ISR_CTSIF_B_0X0               (0x0U<<9)
#define UART4_ISR_CTSIF_B_0X1               (0x1U<<9)
#define UART4_ISR_LBDF_B_0X0                (0x0U<<8)
#define UART4_ISR_LBDF_B_0X1                (0x1U<<8)
#define UART4_ISR_TXFNF_B_0X0               (0x0U<<7)
#define UART4_ISR_TXFNF_B_0X1               (0x1U<<7)
#define UART4_ISR_TC_B_0X0                  (0x0U<<6)
#define UART4_ISR_TC_B_0X1                  (0x1U<<6)
#define UART4_ISR_RXFNE_B_0X0               (0x0U<<5)
#define UART4_ISR_RXFNE_B_0X1               (0x1U<<5)
#define UART4_ISR_IDLE_B_0X0                (0x0U<<4)
#define UART4_ISR_IDLE_B_0X1                (0x1U<<4)
#define UART4_ISR_ORE_B_0X0                 (0x0U<<3)
#define UART4_ISR_ORE_B_0X1                 (0x1U<<3)
#define UART4_ISR_NE_B_0X0                  (0x0U<<2)
#define UART4_ISR_NE_B_0X1                  (0x1U<<2)
#define UART4_ISR_FE_B_0X0                  (0x0U<<1)
#define UART4_ISR_FE_B_0X1                  (0x1U<<1)
#define UART4_ISR_PE_B_0X0                  (0x0U<<0)
#define UART4_ISR_PE_B_0X1                  (0x1U<<0)

// ISR_ALTERNATE Configuration

#define UART4_ISR_ALTERNATE_TCBGT           (0x1U<<25)
#define UART4_ISR_ALTERNATE_REACK           (0x1U<<22)
#define UART4_ISR_ALTERNATE_TEACK           (0x1U<<21)
#define UART4_ISR_ALTERNATE_WUF             (0x1U<<20)
#define UART4_ISR_ALTERNATE_RWU             (0x1U<<19)
#define UART4_ISR_ALTERNATE_SBKF            (0x1U<<18)
#define UART4_ISR_ALTERNATE_CMF             (0x1U<<17)
#define UART4_ISR_ALTERNATE_BUSY            (0x1U<<16)
#define UART4_ISR_ALTERNATE_ABRF            (0x1U<<15)
#define UART4_ISR_ALTERNATE_ABRE            (0x1U<<14)
#define UART4_ISR_ALTERNATE_UDR             (0x1U<<13)
#define UART4_ISR_ALTERNATE_EOBF            (0x1U<<12)
#define UART4_ISR_ALTERNATE_RTOF            (0x1U<<11)
#define UART4_ISR_ALTERNATE_CTS             (0x1U<<10)
#define UART4_ISR_ALTERNATE_CTSIF           (0x1U<<9)
#define UART4_ISR_ALTERNATE_LBDF            (0x1U<<8)
#define UART4_ISR_ALTERNATE_TXE             (0x1U<<7)
#define UART4_ISR_ALTERNATE_TC              (0x1U<<6)
#define UART4_ISR_ALTERNATE_RXNE            (0x1U<<5)
#define UART4_ISR_ALTERNATE_IDLE            (0x1U<<4)
#define UART4_ISR_ALTERNATE_ORE             (0x1U<<3)
#define UART4_ISR_ALTERNATE_NE              (0x1U<<2)
#define UART4_ISR_ALTERNATE_FE              (0x1U<<1)
#define UART4_ISR_ALTERNATE_PE              (0x1U<<0)
#define UART4_ISR_ALTERNATE_TCBGT_B_0X0     (0x0U<<25)
#define UART4_ISR_ALTERNATE_TCBGT_B_0X1     (0x1U<<25)
#define UART4_ISR_ALTERNATE_RWU_B_0X0       (0x0U<<19)
#define UART4_ISR_ALTERNATE_RWU_B_0X1       (0x1U<<19)
#define UART4_ISR_ALTERNATE_SBKF_B_0X0      (0x0U<<18)
#define UART4_ISR_ALTERNATE_SBKF_B_0X1      (0x1U<<18)
#define UART4_ISR_ALTERNATE_CMF_B_0X0       (0x0U<<17)
#define UART4_ISR_ALTERNATE_CMF_B_0X1       (0x1U<<17)
#define UART4_ISR_ALTERNATE_BUSY_B_0X0      (0x0U<<16)
#define UART4_ISR_ALTERNATE_BUSY_B_0X1      (0x1U<<16)
#define UART4_ISR_ALTERNATE_UDR_B_0X0       (0x0U<<13)
#define UART4_ISR_ALTERNATE_UDR_B_0X1       (0x1U<<13)
#define UART4_ISR_ALTERNATE_EOBF_B_0X0      (0x0U<<12)
#define UART4_ISR_ALTERNATE_EOBF_B_0X1      (0x1U<<12)
#define UART4_ISR_ALTERNATE_RTOF_B_0X0      (0x0U<<11)
#define UART4_ISR_ALTERNATE_RTOF_B_0X1      (0x1U<<11)
#define UART4_ISR_ALTERNATE_CTS_B_0X0       (0x0U<<10)
#define UART4_ISR_ALTERNATE_CTS_B_0X1       (0x1U<<10)
#define UART4_ISR_ALTERNATE_CTSIF_B_0X0     (0x0U<<9)
#define UART4_ISR_ALTERNATE_CTSIF_B_0X1     (0x1U<<9)
#define UART4_ISR_ALTERNATE_LBDF_B_0X0      (0x0U<<8)
#define UART4_ISR_ALTERNATE_LBDF_B_0X1      (0x1U<<8)
#define UART4_ISR_ALTERNATE_TXE_B_0X0       (0x0U<<7)
#define UART4_ISR_ALTERNATE_TXE_B_0X1       (0x1U<<7)
#define UART4_ISR_ALTERNATE_TC_B_0X0        (0x0U<<6)
#define UART4_ISR_ALTERNATE_TC_B_0X1        (0x1U<<6)
#define UART4_ISR_ALTERNATE_RXNE_B_0X0      (0x0U<<5)
#define UART4_ISR_ALTERNATE_RXNE_B_0X1      (0x1U<<5)
#define UART4_ISR_ALTERNATE_IDLE_B_0X0      (0x0U<<4)
#define UART4_ISR_ALTERNATE_IDLE_B_0X1      (0x1U<<4)
#define UART4_ISR_ALTERNATE_ORE_B_0X0       (0x0U<<3)
#define UART4_ISR_ALTERNATE_ORE_B_0X1       (0x1U<<3)
#define UART4_ISR_ALTERNATE_NE_B_0X0        (0x0U<<2)
#define UART4_ISR_ALTERNATE_NE_B_0X1        (0x1U<<2)
#define UART4_ISR_ALTERNATE_FE_B_0X0        (0x0U<<1)
#define UART4_ISR_ALTERNATE_FE_B_0X1        (0x1U<<1)
#define UART4_ISR_ALTERNATE_PE_B_0X0        (0x0U<<0)
#define UART4_ISR_ALTERNATE_PE_B_0X1        (0x1U<<0)

// ICR Configuration

#define UART4_ICR_WUCF                      (0x1U<<20)
#define UART4_ICR_CMCF                      (0x1U<<17)
#define UART4_ICR_UDRCF                     (0x1U<<13)
#define UART4_ICR_EOBCF                     (0x1U<<12)
#define UART4_ICR_RTOCF                     (0x1U<<11)
#define UART4_ICR_CTSCF                     (0x1U<<9)
#define UART4_ICR_LBDCF                     (0x1U<<8)
#define UART4_ICR_TCBGTCF                   (0x1U<<7)
#define UART4_ICR_TCCF                      (0x1U<<6)
#define UART4_ICR_TXFECF                    (0x1U<<5)
#define UART4_ICR_IDLECF                    (0x1U<<4)
#define UART4_ICR_ORECF                     (0x1U<<3)
#define UART4_ICR_NECF                      (0x1U<<2)
#define UART4_ICR_FECF                      (0x1U<<1)
#define UART4_ICR_PECF                      (0x1U<<0)

// RDR Configuration

#define UART4_RDR_RDR                       (0x1FFU<<0)
#define UART4_RDR_RDR_0                     (0x1U<<0)

// TDR Configuration

#define UART4_TDR_TDR                       (0x1FFU<<0)
#define UART4_TDR_TDR_0                     (0x1U<<0)

// PRESC Configuration

#define UART4_PRESC_PRESCALER               (0xFU<<0)
#define UART4_PRESC_PRESCALER_0             (0x1U<<0)
#define UART4_PRESC_PRESCALER_B_0X0         (0x0U<<0)
#define UART4_PRESC_PRESCALER_B_0X1         (0x1U<<0)
#define UART4_PRESC_PRESCALER_B_0X2         (0x2U<<0)
#define UART4_PRESC_PRESCALER_B_0X3         (0x3U<<0)
#define UART4_PRESC_PRESCALER_B_0X4         (0x4U<<0)
#define UART4_PRESC_PRESCALER_B_0X5         (0x5U<<0)
#define UART4_PRESC_PRESCALER_B_0X6         (0x6U<<0)
#define UART4_PRESC_PRESCALER_B_0X7         (0x7U<<0)
#define UART4_PRESC_PRESCALER_B_0X8         (0x8U<<0)
#define UART4_PRESC_PRESCALER_B_0X9         (0x9U<<0)
#define UART4_PRESC_PRESCALER_B_0XA         (0xAU<<0)
#define UART4_PRESC_PRESCALER_B_0XB         (0xBU<<0)
